src/Catalogs/ЭД_Модель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Модель</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаМакетаИмпортаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_МакетыИмпорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЭД_ТипыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриоритетДляНастроек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Показатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Показатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭД_Модель</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолонкаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Колонки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Строки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_ТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Колонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Колонки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭД_Модель</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокКолонкиФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАгрегации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_СпособАгрегацииЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_ТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Модель/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьПоказателиНаСервере(мПоказатели)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Объект должен быть записан.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭД_Показатели.Ссылка КАК Ссылка,
	|	ЭД_Показатели.СтрокаЭД КАК СтрокаЭД,
	|	ЭД_Показатели.КолонкаЭД КАК КолонкаЭД
	|ПОМЕСТИТЬ втПоказатели
	|ИЗ
	|	Справочник.ЭД_Показатели КАК ЭД_Показатели
	|ГДЕ
	|	ЭД_Показатели.Владелец = &Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭД_Строки.Ссылка КАК Строка,
	|	ЭД_Колонки.Ссылка КАК Колонка
	|ПОМЕСТИТЬ втВсеСтрокиКолонки
	|ИЗ
	|	Справочник.ЭД_Строки КАК ЭД_Строки,
	|	Справочник.ЭД_Колонки КАК ЭД_Колонки
	|ГДЕ
	|	ЭД_Строки.Владелец = &Модель
	|	И ЭД_Колонки.Владелец = &Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеСтрокиКолонки.Строка КАК Строка,
	|	втВсеСтрокиКолонки.Колонка КАК Колонка,
	|	втВсеСтрокиКолонки.Строка.Наименование КАК СтрокаНаименование,
	|	втВсеСтрокиКолонки.Колонка.Наименование КАК КолонкаНаименование
	|ИЗ
	|	втВсеСтрокиКолонки КАК втВсеСтрокиКолонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоказатели КАК втПоказатели
	|		ПО втВсеСтрокиКолонки.Строка = втПоказатели.СтрокаЭД
	|			И втВсеСтрокиКолонки.Колонка = втПоказатели.КолонкаЭД
	|ГДЕ
	|	втПоказатели.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Модель", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    		
		НовыйПоказатель 	= Справочники.ЭД_Показатели.СоздатьЭлемент();
		НовыйПоказатель.Наименование 	= Выборка.СтрокаНаименование + " " + Выборка.КолонкаНаименование;
		НовыйПоказатель.Владелец 		= Объект.Ссылка;
		НовыйПоказатель.СтрокаЭД 		= Выборка.Строка;
		НовыйПоказатель.КолонкаЭД 		= Выборка.Колонка;
		НовыйПоказатель.Длина			= Выборка.Колонка.Длина;
		НовыйПоказатель.Точность		= Выборка.Колонка.Точность;
		НовыйПоказатель.НеМасштабируется= Выборка.Колонка.НеМасштабируется;
		НовыйПоказатель.Записать();
		мПоказатели.Добавить(НовыйПоказатель.Ссылка);
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоказатели(Команда)
	
	мПоказатели = Новый Массив;	
	СоздатьПоказателиНаСервере(мПоказатели);
	Для Каждого стр Из мПоказатели Цикл
		ОповеститьОбИзменении(стр);
	КонецЦикла;	     	

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвойства(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	ПолеПоиск = Новый ПолеКомпоновкиДанных("Владелец");
	
	СтруктураПараметров.Вставить("МодельЭД", Объект.Ссылка);
	
	сзПоказатели = Новый СписокЗначений;
	сзПоказатели.ЗагрузитьЗначения(Элементы.Показатели.ВыделенныеСтроки);
	
	СтруктураПараметров.Вставить("сзПоказатели", сзПоказатели);
	
	Форма = ОткрытьФорму("ОбщаяФорма.ЭД_ФормаРедактированияРеквизитов", СтруктураПараметров);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметры(ТекСсылка)
	
	Показатели.Параметры.УстановитьЗначениеПараметра("Владелец", ТекСсылка);
	Строки.Параметры.УстановитьЗначениеПараметра("Владелец", ТекСсылка);
	Колонки.Параметры.УстановитьЗначениеПараметра("Владелец", ТекСсылка);
	МакетыИмпорта.Параметры.УстановитьЗначениеПараметра("Владелец", ТекСсылка);
	
КонецПроцедуры	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		УстановитьПараметры(Объект.Ссылка);
КонецПроцедуры
